andrzej-kaczmarek/apache-mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    /* Turn off trigger TXEN on output compare match and AAR on bcmatch */
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    phy_ppi_radio_bcmatch_to_aar_start_disable();

    /* Reset the rx started flag. Used for the wait for response */
    g_ble_phy_data.phy_rx_started = 0;
    g_ble_phy_data.phy_state = BLE_PHY_STATE_RX;

#if MYNEWT_VAL(BLE_LL_PHY)
    /*
     * On Coded PHY there are CI and TERM1 fields before PDU starts so we need
     * to take this into account when setting up BCC.
     */
    if (g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_125KBPS ||
            g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_500KBPS) {
        g_ble_phy_data.phy_bcc_offset = 5;
    } else {
        g_ble_phy_data.phy_bcc_offset = 0;
    }
#else
    g_ble_phy_data.phy_bcc_offset = 0;
#endif

    /* I want to know when 1st byte received (after address) */
    nrf_radio_bcc_set(NRF_RADIO, 8 + g_ble_phy_data.phy_bcc_offset); /* in bits */
    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_DEVMATCH = 0;
    NRF_RADIO->EVENTS_BCMATCH = 0;
    NRF_RADIO->EVENTS_RSSIEND = 0;
    NRF_RADIO->EVENTS_CRCOK = 0;
    NRF_RADIO->SHORTS = RADIO_SHORTS_END_DISABLE_Msk |
                        RADIO_SHORTS_READY_START_Msk |
                        RADIO_SHORTS_ADDRESS_BCSTART_Msk |
                        RADIO_SHORTS_ADDRESS_RSSISTART_Msk |
                        RADIO_SHORTS_DISABLED_RSSISTOP_Msk;

    nrf_radio_int_enable(NRF_RADIO, RADIO_INTENSET_ADDRESS_Msk |
                         RADIO_INTENSET_DISABLED_Msk);
}

static inline uint32_t
anchor_rxd_get(uint8_t rx_phy_mode)
{
    if (g_ble_phy_data.tifs_anchor) {
        /* Anchor is time of EVENT_END captured in CC[2] adjusted for delay
         * between the event and actual RX end time
         */
        return nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL2) -
               g_ble_phy_t_rxenddelay[rx_phy_mode];
    } else {
        /* Anchor is time of EVENT_ADDRESS captured in CC[1] adjusted for
         * duration of syncword and delay between the event and actual RX end
         * time.
         */
        return nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL1) -
               ble_ll_pdu_syncword_us(rx_phy_mode) -
               g_ble_phy_t_rxaddrdelay[rx_phy_mode];
    }
}

static inline uint32_t
anchor_txd_get(uint8_t tx_phy_mode)
{
    if (g_ble_phy_data.tifs_anchor) {
        /* Anchor is time of EVENT_END captured in CC[2] adjusted for delay
         * between the event and actual TX end time
         */
        return nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL2) +
               g_ble_phy_t_txenddelay[tx_phy_mode];
    } else {
        /* Anchor is time of EVENT_ADDRESS captured in CC[1] adjusted for
         * duration of syncword and delay between the event and actual TX end
         * time.
         *
         * FIXME this assumes delay for EVENT_ADDRESS is the same as EVENT_END,
         *       should be measured to be sure.
         */
        return nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL1) -
               ble_ll_pdu_syncword_us(tx_phy_mode) +
               g_ble_phy_t_txenddelay[tx_phy_mode];
    }
}

static void
transition_to_tx(uint32_t anchor_us, uint8_t tx_phy_mode)
{
    uint32_t tx_time;
    uint32_t radio_time;
    uint32_t fem_time;
    uint32_t cc_time;
    bool is_late;

    tx_time = anchor_us + g_ble_phy_data.tifs_us;

#if PHY_USE_FEM_PA
    fem_time = tx_time - MYNEWT_VAL(BLE_FEM_PA_TURN_ON_US);
#endif

    /* Adjust for delay between EVENT_READY and actual TX start time */
    tx_time -= g_ble_phy_t_txdelay[tx_phy_mode];

    radio_time = tx_time - BLE_PHY_T_TXENFAST;
    nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL0, radio_time);
    nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE0);
    phy_ppi_timer0_compare0_to_radio_txen_enable();

#if PHY_USE_FEM_PA
    nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL2, fem_time);
    nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE2);
    phy_fem_enable_pa();
#endif

    /* Need to check if TIMER0 did not already count past CC[0] and/or CC[2], so
     * we're not stuck waiting for events in case radio and/or PA was not
     * started. If event was triggered we're fine regardless of timer value.
     *
     * Note: CC[3] is used only for wfr which we do not need here.
     */
    nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CAPTURE3);
    cc_time = nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL3);
    is_late = LL_TMR_GT(cc_time, radio_time) &&
              !nrf_timer_event_check(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE0);
#if PHY_USE_FEM_PA
    if (!is_late) {
        is_late = LL_TMR_GT(cc_time, fem_time) &&
              !nrf_timer_event_check(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE2);
    }
#endif
    if (is_late) {
        phy_ppi_timer0_compare0_to_radio_txen_disable();
        g_ble_phy_data.phy_transition_late = 1;
    }
}

static void
transition_to_rx(uint32_t anchor_us, uint8_t rx_phy_mode)
{
    uint32_t rx_time;
    uint32_t radio_time;
    uint32_t fem_time;

    rx_time = anchor_us + g_ble_phy_data.tifs_us;
    /* Start listening 2us earlier due to allowed active clock accuracy */
    rx_time -= 2;

    (void)fem_time;
#if PHY_USE_FEM_LNA
    fem_time = rx_time - MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US);
    nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL2, fem_time);
    nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE2);
    phy_fem_enable_lna();
#endif

    radio_time = rx_time - BLE_PHY_T_RXENFAST;
    nrf_timer_cc_set(NRF_TIMER0, NRF_TIMER_CC_CHANNEL0, radio_time);
    nrf_timer_event_clear(NRF_TIMER0, NRF_TIMER_EVENT_COMPARE0);
    phy_ppi_timer0_compare0_to_radio_rxen_enable();
}

/**
 * Called from interrupt context when the transmit ends
 *
 */
static void
ble_phy_tx_end_isr(void)
{
    uint8_t tx_phy_mode;
    uint8_t was_encrypted;
    uint8_t transition;
    uint32_t rx_time;
    uint32_t tx_time;
#if PHY_USE_FEM
    uint32_t fem_time;
#endif
    uint32_t anchor_us;
    uint32_t radio_time;
    uint16_t tifs;

    /* Store PHY on which we've just transmitted smth */
    tx_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    /* If this transmission was encrypted we need to remember it */
    was_encrypted = g_ble_phy_data.phy_encrypted;
    (void)was_encrypted;

    /* Better be in TX state! */
    assert(g_ble_phy_data.phy_state == BLE_PHY_STATE_TX);

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    /*
     * XXX: not sure what to do. We had a HW error during transmission.
     * For now I just count a stat but continue on like all is good.
     */
    if (was_encrypted) {
        if (NRF_CCM->EVENTS_ERROR) {
            STATS_INC(ble_phy_stats, tx_hw_err);
            NRF_CCM->EVENTS_ERROR = 0;
        }
    }
#endif

