andrzej-kaczmarek/apache-mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    anchor_us = anchor_txd_get(g_ble_phy_data.phy_cur_phy_mode);
    transition = g_ble_phy_data.transition;

    if (g_ble_phy_data.txend_cb) {
        g_ble_phy_data.txend_cb(g_ble_phy_data.txend_arg);
    }

    if (transition == BLE_PHY_TRANSITIONX_TO_RX) {
        ble_phy_apply_mode(BLE_PHY_DIR_RX);
        ble_phy_rx_xcvr_setup();
        wfr_enable(0, tx_phy_mode);

        transition_to_rx(anchor_us, )

        /* Schedule RX exactly T_IFS after TX end captured in CC[2] */
        rx_time = NRF_TIMER0->CC[2] + tifs;
        /* Adjust for delay between EVENT_END and actual TX end time */
        rx_time += g_ble_phy_t_txenddelay[tx_phy_mode];
        /* Start listening a bit earlier due to allowed active clock accuracy */
        rx_time -= 2;

#if PHY_USE_FEM_LNA
        fem_time = rx_time - MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US);
        nrf_timer_cc_set(NRF_TIMER0, 2, fem_time);
        NRF_TIMER0->EVENTS_COMPARE[2] = 0;
        phy_fem_enable_lna();
#endif

        radio_time = rx_time - BLE_PHY_T_RXENFAST;
        nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);
        NRF_TIMER0->EVENTS_COMPARE[0] = 0;
        phy_ppi_timer0_compare0_to_radio_rxen_enable();

        /* In case TIMER0 did already count past CC[0] and/or CC[2], radio
         * and/or LNA may not be enabled. In any case we won't be stuck since
         * wfr will cancel rx if needed.
         *
         * FIXME failing to enable LNA may result in unexpected RSSI drop in
         *       case we still rxd something, so perhaps we could check it here
         */
    } else if (transition == BLE_PHY_TRANSITIONX_TO_TX) {
        if (g_ble_phy_data.txtx_time_anchor) {
            /* Calculate TX anchor relative to current TX end */

            /* TX end timestamp is captured in CC[2] */
            tx_time = NRF_TIMER0->CC[2];
            /* Adjust for delay between EVENT_END and actual TX end time */
            tx_time += g_ble_phy_t_txenddelay[tx_phy_mode];
        } else {
            /* Calculate TX anchor relative to current TX start */

            /* AA timestamp is captured in CC[1] */
            tx_time = NRF_TIMER0->CC[1];
            /* Adjust for delay between EVENT_ADDRESS and actual AA time ota */
            tx_time += g_ble_phy_t_txaddrdelay[tx_phy_mode];
            /* Adjust by sync word length to get TX start time */
            tx_time -= ble_ll_pdu_syncword_us(tx_phy_mode);
        }

        tx_time += g_ble_phy_data.txtx_time_us;

#if PHY_USE_FEM_PA
        fem_time = tx_time - MYNEWT_VAL(BLE_FEM_PA_TURN_ON_US);
#endif

        /* Adjust for delay between EVENT_READY and actual TX start time */
        tx_time -= g_ble_phy_t_txdelay[g_ble_phy_data.phy_cur_phy_mode];

        radio_time = tx_time - BLE_PHY_T_TXENFAST;
        nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);
        NRF_TIMER0->EVENTS_COMPARE[0] = 0;
        phy_ppi_timer0_compare0_to_radio_txen_enable();

#if PHY_USE_FEM_PA
        nrf_timer_cc_set(NRF_TIMER0, 2, fem_time);
        NRF_TIMER0->EVENTS_COMPARE[2] = 0;
        phy_fem_enable_pa();
#endif

        nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CAPTURE3);
        if (NRF_TIMER0->CC[3] > NRF_TIMER0->CC[0]) {
            phy_ppi_timer0_compare0_to_radio_txen_disable();
            g_ble_phy_data.phy_transition_late = 1;
        }
    } else {
        /*
         * XXX: not sure we need to stop the timer here all the time. Or that
         * it should be stopped here.
         */
        nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_STOP);
        NRF_TIMER0->TASKS_SHUTDOWN = 1;
        phy_ppi_wfr_disable();
        phy_ppi_timer0_compare0_to_radio_txen_disable();
        phy_ppi_rtc0_compare0_to_timer0_start_disable();
        assert(transition == BLE_PHY_TRANSITIONX_NONE);
    }
}

static inline uint8_t
ble_phy_get_cur_rx_phy_mode(void)
{
    uint8_t phy;

    phy = g_ble_phy_data.phy_cur_phy_mode;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_CODED_PHY)
    /*
     * For Coded PHY mode can be set to either codings since actual coding is
     * set in packet header. However, here we need actual coding of received
     * packet as this determines pipeline delays so need to figure this out
     * using CI field.
     */
    if ((phy == BLE_PHY_MODE_CODED_125KBPS) ||
                                    (phy == BLE_PHY_MODE_CODED_500KBPS)) {
        phy = NRF_RADIO->PDUSTAT & RADIO_PDUSTAT_CISTAT_Msk ?
                                   BLE_PHY_MODE_CODED_500KBPS :
                                   BLE_PHY_MODE_CODED_125KBPS;
    }
#endif

    return phy;
}

static void
ble_phy_rx_end_isr(void)
{
    int rc;
    uint8_t *dptr;
    uint8_t crcok;
    struct ble_mbuf_hdr *ble_hdr;
    uint32_t anchor_us;

    /* Disable automatic RXEN */
    phy_ppi_timer0_compare0_to_radio_rxen_disable();

    /* Set RSSI and CRC status flag in header */
    ble_hdr = &g_ble_phy_data.rxhdr;
    assert(NRF_RADIO->EVENTS_RSSIEND != 0);
    ble_hdr->rxinfo.rssi = (-1 * NRF_RADIO->RSSISAMPLE);

    dptr = (uint8_t *)&g_ble_phy_rx_buf[0];
    dptr += 3;

    /* Count PHY crc errors and valid packets */
    crcok = NRF_RADIO->EVENTS_CRCOK;
    if (!crcok) {
        STATS_INC(ble_phy_stats, rx_crc_err);
    } else {
        STATS_INC(ble_phy_stats, rx_valid);
        ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_CRC_OK;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
        if (g_ble_phy_data.phy_encrypted) {
            while (NRF_CCM->EVENTS_ENDCRYPT == 0) {
                /* Make sure CCM finished */
            };

            /* Only set MIC failure flag if frame is not zero length */
            if ((dptr[1] != 0) && (NRF_CCM->MICSTATUS == 0)) {
                ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_MIC_FAILURE;
            }

            /*
             * XXX: not sure how to deal with this. This should not
             * be a MIC failure but we should not hand it up. I guess
             * this is just some form of rx error and that is how we
             * handle it? For now, just set CRC error flags
             */
            if (NRF_CCM->EVENTS_ERROR) {
                STATS_INC(ble_phy_stats, rx_hw_err);
                ble_hdr->rxinfo.flags &= ~BLE_MBUF_HDR_F_CRC_OK;
            }
        }
#endif
    }

